Revit 2027 API
Ellipse.RadiusX Property
Returns the X vector radius of the ellipse.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double RadiusX { get; }
Public ReadOnly Property RadiusX As Double
	Get
public:
property double RadiusX {
	double get ();
}
member RadiusX : float with get
Property Value
Double
See Also
Reference
Ellipse Class
Autodesk.Revit.DB Namespace